uhnp/src/InformationRegisters/СтатусыПериодовСценариев/СтатусыПериодовСценариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыПериодовСценариев</name>
  <resources>
    <name>СтатусПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусБлокировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытияПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияРегламента</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </resources>
  <attributes>
    <name>УправлениеПериодомСценария</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сценарии</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Периоды</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организации</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ЗначенияПоказателейОтчетов6/ЗначенияПоказателейОтчетов6.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияПоказателейОтчетов6</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеВалюта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИтоговоеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбработки</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемаяИБ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследнийРедактировавший</name>
    <comment>Пользователь, внесший последние изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФормированияОтчета</name>
    <type>
      <types>EnumRef.СпособыФормированияОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияMs</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииЗначенийПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПоказателиОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/НастройкиПравилТрансляции/НастройкиПравилТрансляции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПравилТрансляции</name>
  <resources>
    <name>ИспользованиеДт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеКт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименениеПоКорреспонденции</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоррСчетИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </resources>
  <resources>
    <name>ТранслироватьСальдо</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТранслироватьОбороты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриоритетТрансляции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ШаблонТрансляции</name>
    <type>
      <types>CatalogRef.ШаблоныТрансляций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоответствиеСчетов</name>
    <type>
      <types>CatalogRef.СоответствияСчетовДляТрансляции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccountingRegisters/МСФО/МСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>МСФО</name>
  <chartOfAccounts>ChartOfAccounts.МСФО</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОпераций</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>СуммаВВалютеУчета</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВВалютеОтчетности</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетДтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоДт</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоКт</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

uhnp/src/Enums/СпособыВычисленияПараметровОперандов/СпособыВычисленияПараметровОперандов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВычисленияПараметровОперандов</name>
  <enumValues>
    <name>ПериодОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПериодОтчетаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаПериодаОтчета</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаПериодаОтчета</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаПериодаОтчетаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаПериодаОтчетаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаГода</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаГодаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаГода</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаГодаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>АналогичныйПериодПредыдущегоГода</name>
  </enumValues>
  <enumValues>
    <name>АналогичныйПериодГодаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>ВалютаОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПериметрОтчета</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияОтчета</name>
  </enumValues>
  <enumValues>
    <name>НеПериметрОтчета</name>
  </enumValues>
  <enumValues>
    <name>СценарийОтчета</name>
  </enumValues>
  <enumValues>
    <name>СценарийФакта</name>
  </enumValues>
  <enumValues>
    <name>Аналитика1</name>
  </enumValues>
  <enumValues>
    <name>Аналитика2</name>
  </enumValues>
  <enumValues>
    <name>Аналитика3</name>
  </enumValues>
  <enumValues>
    <name>Аналитика4</name>
  </enumValues>
  <enumValues>
    <name>Аналитика5</name>
  </enumValues>
  <enumValues>
    <name>Аналитика6</name>
  </enumValues>
  <enumValues>
    <name>ФункцияНаВстроенномЯзыкеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ФиксированноеЗначение</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>НеИспользуется</name>
  </enumValues>
  <enumValues>
    <name>СписокФиксированныхЗначений</name>
  </enumValues>
  <enumValues>
    <name>СписокПоИерархии</name>
  </enumValues>
  <enumValues>
    <name>ОтборПоРеквизитамАналитики</name>
  </enumValues>
  <enumValues>
    <name>НеРавноФиксированномуЗначению</name>
  </enumValues>
  <enumValues>
    <name>НеВСпискеФиксированныхЗначений</name>
  </enumValues>
  <enumValues>
    <name>НеВСпискеПоИерархии</name>
  </enumValues>
  <enumValues>
    <name>ИнтервалПериодов</name>
  </enumValues>
  <enumValues>
    <name>ГруппаИ</name>
  </enumValues>
  <enumValues>
    <name>ГруппаИЛИ</name>
  </enumValues>
  <enumValues>
    <name>ГруппаНЕ</name>
  </enumValues>
  <enumValues>
    <name>Больше</name>
  </enumValues>
  <enumValues>
    <name>БольшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>Меньше</name>
  </enumValues>
  <enumValues>
    <name>МеньшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>ФункцияНаВстроенномЯзыкеСписокЗначений</name>
  </enumValues>
  <enumValues>
    <name>ПроектОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПроектОтчетаИерархия</name>
  </enumValues>
  <enumValues>
    <name>ВышестоящийПериод</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаВышестоящегоПериода</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаВышестоящегоПериода</name>
  </enumValues>
  <enumValues>
    <name>ИсходныйДокумент</name>
  </enumValues>
  <enumValues>
    <name>ТипЗначения</name>
  </enumValues>
  <enumValues>
    <name>СписокТиповЗначений</name>
  </enumValues>
  <enumValues>
    <name>СохраненнаяНастройкаОтбора</name>
  </enumValues>
  <enumValues>
    <name>НеПериодОтчета</name>
  </enumValues>
  <enumValues>
    <name>ФункцияНаВстроенномЯзыкеЗначениеВладельца</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыБухгалтерскихИтогов/ВидыБухгалтерскихИтогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыБухгалтерскихИтогов</name>
  <enumValues>
    <name>СНД</name>
  </enumValues>
  <enumValues>
    <name>СНК</name>
  </enumValues>
  <enumValues>
    <name>ДО</name>
  </enumValues>
  <enumValues>
    <name>КО</name>
  </enumValues>
  <enumValues>
    <name>СКД</name>
  </enumValues>
  <enumValues>
    <name>СКК</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыДетализацииКорреспонденцииСчета/СпособыДетализацииКорреспонденцииСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыДетализацииКорреспонденцииСчета</name>
  <enumValues>
    <name>НеРаскрывать</name>
  </enumValues>
  <enumValues>
    <name>РаскрыватьПоВидамДвижений</name>
  </enumValues>
  <enumValues>
    <name>РаскрыватьПоКоррСчетам</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыСчетовБД/ВидыСчетовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСчетовБД</name>
  <enumValues>
    <name>Активный</name>
  </enumValues>
  <enumValues>
    <name>Пассивный</name>
  </enumValues>
  <enumValues>
    <name>АктивноПассивный</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/СоответствияСчетовДляТрансляции/СоответствияСчетовДляТрансляции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоответствияСчетовДляТрансляции</name>
  <owners>Catalog.ШаблоныТрансляций</owners>
  <attributes>
    <name>СчетИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПриемник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
      <types>CatalogRef.СтрокиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРаскрытия</name>
    <type>
      <types>CatalogRef.ГруппыРаскрытия</types>
    </type>
  </attributes>
  <attributes>
    <name>НеТранслировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСоответствия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектУчетаИсточник</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектНастройки</name>
    <type>
      <types>String</types>
      <types>EnumRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоррОбъектУчетаИсточник</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррОбъектНастройки</name>
    <type>
      <types>String</types>
      <types>EnumRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/CommonModules/МСФОЗапросыУХ/Module.bsl
#Область ПрограммныйИнтерфейс

#Область Общие

Функция ТекстЗапроса_УничтожитьТаблицу(НомераТаблиц, ИмяТаблицы = "втВЗП", УничтожитьТаблицы = Истина) Экспорт
	
	Если Не УничтожитьТаблицы Тогда
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("УНИЧТОЖИТЬ_" + ИмяТаблицы, НомераТаблиц.Количество());
	
	Возврат "УНИЧТОЖИТЬ " + ИмяТаблицы;

КонецФункции

Функция ЗаменитьПараметрыЗапроса(ТекстЗапроса, ПараметрыЗамены) Экспорт

	Для Каждого Параметр Из ПараметрыЗамены Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&" + Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ДобавитьЗапросПоШаблону(ТекстЗапроса, ШаблонЗапроса, Процессор) Экспорт
	
	ТекстПоШаблону = ШаблонЗапроса;
	Для каждого Замена Из Процессор.ПараметрыЗамены Цикл
		ТекстПоШаблону = СтрЗаменить(ТекстПоШаблону, Замена.Ключ, Замена.Значение);
	КонецЦикла;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Запрос_Трансляция

Функция НастройкиШаблонаТрансляции(ШаблонТрансляцииИлиШаблонВГО = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	ШаблонТрансляции = ПолучитьШаблонТрансляции(ШаблонТрансляцииИлиШаблонВГО);
	
	НомераТаблиц = Новый Структура;
	
	ТекстЗапроса = Новый Массив;
	ТекстЗапроса.Добавить(ТекстЗапроса_втСпособыВычисления(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втПутиСубконто(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_ДоступныеОтборы(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_ДоступныеПути(НомераТаблиц));
	
	Запрос = Новый Запрос(СтрСоединить(ТекстЗапроса, ПроведениеСерверУХ.РазделительЗапросовВПакете()));
	Запрос.УстановитьПараметр("ШаблонТрансляции", ШаблонТрансляции);
	
	ПроведениеСерверУХ.ДополнитьТаблицамиИзПакетаЗапросов(
		Результат, Запрос, НомераТаблиц);
	
	ЧислоСтрок = Результат.ДоступныеОтборы.Количество()-1;
	Для й = 0 По ЧислоСтрок Цикл
		
		
		СтрокаТаб = Результат.ДоступныеОтборы.Получить(ЧислоСтрок-й);
		
		Если Не ЗначениеЗаполнено(СтрокаТаб.ТипДанных) Тогда
			Продолжить;
		ИначеЕсли Не ЗначениеЗаполнено(СтрокаТаб.Поле_Остаток) Тогда
			Продолжить;
		ИначеЕсли СтрНайти(СтрокаТаб.ТипДанных, ";") > 0 Тогда
			ПроверитьСоставноеПолеТрансляции(СтрокаТаб); //** у составного типа могут быть ошибки
		Иначе 
			ПроверитьПростоеПолеТрансляции(СтрокаТаб);
		КонецЕсли;
		
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

Функция НовыйПроцессорТрансляцииЗапросом(ШаблонТрансляции = Неопределено) Экспорт

	Процессор = Новый Структура;
	
	Если ШаблонТрансляции = Неопределено Тогда
		ШаблонТрансляции = МСФОВызовСервераУХ.ЗначениеУП(
			"ШаблонТрансляции", Справочники.Организации.ПустаяСсылка());
	КонецЕсли;
	
	Процессор.Вставить("ШаблонТрансляции", ШаблонТрансляции);
	Процессор.Вставить("ИмяТаблицыИсточника", "ТаблицаИсточник"); // таблица-источник проводок 
	
	// ключ: поле-источник таблицы полей, или (Ключ:Поле-приемник(СубконтоДт1), Значение:поле-источник таблицы полей(Субконто1))
	Процессор.Вставить("ПоляПриемники", ПоляПриемникиТрансляции()); 
	Процессор.Вставить("ПоляИсточники", ПоляИсточникаТрансляции());
	Процессор.Вставить("ПутиИсключения", Новый Массив);
	
	Процессор.Вставить("ДоступныеОтборы");// пути отборов трансляции из КэшТрансляции
	Процессор.Вставить("ДоступныеПути");  // пути полей трансляции из КэшТрансляции
	
	Процессор.Вставить("СтороныТрансляции", Новый Структура);
	ПодготовитьСторонуТрансляции(Процессор);
	
	// замены параметров в запросе с соединениями трансляции
	Процессор.Вставить("ЗаменыПараметров", Новый Структура); 
	
	Возврат Процессор;

КонецФункции

Функция ТекстЗапроса_втСпособыВычисления(НомераТаблиц) Экспорт

	НомераТаблиц.Вставить("втСпособыВычисления", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.СпособыВычисленияПараметровОперандов.ФиксированноеЗначение) КАК Способ,
	|	ЛОЖЬ КАК ЭтоНе,
	|	0 КАК СписокИерархия
	|ПОМЕСТИТЬ втСпособыВычисления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.СпособыВычисленияПараметровОперандов.СписокФиксированныхЗначений),
	|	ЛОЖЬ,
	|	1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.СпособыВычисленияПараметровОперандов.СписокПоИерархии),
	|	ЛОЖЬ,
	|	2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.СпособыВычисленияПараметровОперандов.НеРавноФиксированномуЗначению),
	|	ИСТИНА,
	|	0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.СпособыВычисленияПараметровОперандов.НеВСпискеФиксированныхЗначений),
	|	ИСТИНА,
	|	1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.СпособыВычисленияПараметровОперандов.НеВСпискеПоИерархии),
	|	ИСТИНА,
	|	2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Способ";
	
КонецФункции

Функция ДобавитьЗапросыТрансляции(ТекстЗапроса, НомераТаблиц, ТекстЗапросаСчетаИсточники = Неопределено) Экспорт

	ТекстЗапроса.Добавить(ТекстЗапроса_втСоответствияТрансляции(НомераТаблиц, ТекстЗапросаСчетаИсточники));
	
	ТекстЗапроса.Добавить(ТекстЗапроса_втСпособыВычисления(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втОтборыПолей(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втЗначенияОтборовТрансляции(НомераТаблиц));	
	
	ТекстЗапроса.Добавить(ТекстЗапроса_втПолучениеПолей(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втПравилаПолей(НомераТаблиц));
	
КонецФункции

Функция ПодготовитьЗаменыПараметровТрансляции(Процессор) Экспорт

	ПодготовитьКэшТрансляции(Процессор);
	УдалитьПутиИсключения(Процессор);
	
	Для каждого ИмяСтороны Из Процессор.СтороныТрансляции Цикл
		
		ПодготовитьСторонуТрансляции(Процессор, ИмяСтороны.Ключ, ИмяСтороны.Значение);
		
		ДобавитьЗаменыПолейВыбораТрансляции(Процессор);
		
		ДобавитьОтборыСтороныТрансляции(Процессор);
		ДобавитьОтборОперандаТрансляции(Процессор);
		ДобавитьЗаменуОтбораТрансляции(Процессор);
	
	КонецЦикла;
	
	Возврат Процессор.ЗаменыПараметров
	
КонецФункции

Функция ПоляПриемникиТрансляцииДтКт() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("СчетДт", 					"Счет");
	Результат.Вставить("СубконтоДт1",				"Субконто1");
	Результат.Вставить("СубконтоДт2",				"Субконто2");
	Результат.Вставить("СубконтоДт3",				"Субконто3");
	Результат.Вставить("ВалютаДт",					"Валюта");
	Результат.Вставить("ПодразделениеДт",			"Подразделение");
	Результат.Вставить("НаправлениеДеятельностиДт",	"НаправлениеДеятельности");
	
	Результат.Вставить("СчетКт", 					"Счет");
	Результат.Вставить("СубконтоКт1",				"Субконто1");
	Результат.Вставить("СубконтоКт2",				"Субконто2");
	Результат.Вставить("СубконтоКт3",				"Субконто3");
	Результат.Вставить("ВалютаКт",					"Валюта");
	Результат.Вставить("ПодразделениеКт",			"Подразделение");
	Результат.Вставить("НаправлениеДеятельностиКт",	"НаправлениеДеятельности");
	
	Результат.Вставить("Регистратор",	"Регистратор");
	Результат.Вставить("Организация",	"Организация");
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область Запрос_Распределение

Функция НастройкиРаспределения(ТекстЗапроса, ИмяТаблицы = "втРаспределение", 
	ИменаГруппировок = "УзелИсточник, УзелПриемник", 
	ПутиСумм = "Распределение:База;РаспределениеВО:БазаВО",
	ПолеНомерРаспределения = "НомерРаспределения",
	УничтожатьТаблицы = Истина) Экспорт

	Возврат Новый Структура(
		"ТекстЗапроса, ИмяТаблицы, ИменаГруппировок, ПутиСумм, ПолеНомерРаспределения, УничтожатьТаблицы", 
		ТекстЗапроса, ИмяТаблицы, ИменаГруппировок, ПутиСумм, ПолеНомерРаспределения, УничтожатьТаблицы); 

КонецФункции

Функция ДобавитьТекстыЗапросовРаспределений(ТекстЗапроса, НомераТаблиц, НастройкиРаспределения) Экспорт
	
	ИмяТаблицы = НастройкиРаспределения.ИмяТаблицы;
	
	ИмяТаблицыДо = ИмяТаблицы + "_До";
	НомераТаблиц.Вставить(ИмяТаблицыДо, НомераТаблиц.Количество());
	ТекстДо = СтрЗаменить(НастройкиРаспределения.ТекстЗапроса, ИмяТаблицы, ИмяТаблицыДо);
	ТекстЗапроса.Добавить(ТекстДо);
	
	ИмяТаблицыНеточности = ИмяТаблицы + "_Неточности";
	НомераТаблиц.Вставить(ИмяТаблицыНеточности, НомераТаблиц.Количество());
	ТекстЗапроса.Добавить(ТекстЗапроса_втНеточностиРаспределений(
		НастройкиРаспределения, ИмяТаблицыДо, ИмяТаблицыНеточности));
	
	НомераТаблиц.Вставить(ИмяТаблицы, НомераТаблиц.Количество());
	ТекстЗапроса.Добавить(ТекстЗапроса_втРезультатыРаспределений(
		НастройкиРаспределения, ИмяТаблицы, ИмяТаблицыДо, ИмяТаблицыНеточности));
		
	УничтожатьТаблицы = НастройкиРаспределения.УничтожатьТаблицы;
	Если УничтожатьТаблицы Тогда
		
		ТекстЗапроса.Добавить(ТекстЗапроса_УничтожитьТаблицу(
			НомераТаблиц, ИмяТаблицыДо, УничтожатьТаблицы));
			
		ТекстЗапроса.Добавить(ТекстЗапроса_УничтожитьТаблицу(
			НомераТаблиц, ИмяТаблицыНеточности, УничтожатьТаблицы));
		
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область Запрос_АОСВ

Функция ПараметрыСПС() Экспорт

	Возврат Новый Структура();

КонецФункции

Функция ТекстЗапроса_втСПС(НомераТаблиц, ПараметрыСПС = Неопределено, ИмяТаблицы = "втСПС") Экспорт
	
	Если ПараметрыСПС = Неопределено Тогда
		ПараметрыСПС = ПараметрыСПС();
	КонецЕсли;
	
	НомераТаблиц.Вставить(ИмяТаблицы, НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	т.Сценарии КАК Сценарий,
	|	т.Периоды КАК ПериодСценария,
	|	т.Организации КАК Организация,
	|	т.Периоды.ДатаНачала = МАКСИМУМ(Границы.ДатаНачала) КАК ЭтоНачало,
	|	т.Периоды.ДатаОкончания = МАКСИМУМ(Границы.ДатаОкончания) КАК ЭтоОкончание,
	|	МАКСИМУМ(т.УправлениеПериодомСценария) КАК УОП,
	|	МАКСИМУМ(т.ВерсияРегламента) КАК Регламент
	|ПОМЕСТИТЬ втСПС
	|ИЗ
	|	РегистрСведений.СтатусыПериодовСценариев КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			т.Сценарии КАК Сценарий,
	|			т.Организации КАК Организация,
	|			МИНИМУМ(т.Периоды.ДатаНачала) КАК ДатаНачала,
	|			МАКСИМУМ(т.Периоды.ДатаОкончания) КАК ДатаОкончания
	|		ИЗ
	|			РегистрСведений.СтатусыПериодовСценариев КАК т
	|		ГДЕ
	|			т.Периоды.ДатаОкончания >= &ДатаНачала
	|			И т.Периоды.ДатаНачала <= &ДатаОкончания
	|			И т.Организации В(&Организация)
	|			И т.Сценарии В(&Сценарий)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			т.Организации,
	|			т.Сценарии) КАК Границы
	|		ПО т.Сценарии = Границы.Сценарий
	|			И т.Организации = Границы.Организация
	|ГДЕ
	|	т.Периоды.ДатаОкончания >= &ДатаНачала
	|	И т.Периоды.ДатаНачала <= &ДатаОкончания
	|	И т.Организации В(&Организация)
	|	И т.Сценарии В(&Сценарий)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Организации,
	|	т.Сценарии,
	|	т.Периоды,
	|	т.Периоды.ДатаНачала";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПараметрыВЗП(ИмяВалюта = "&ФВ", 
		ИмяПериодОтчета = "&ПериодОтчета", ИмяВидОтчета = "&ВидОтчета", 
		ИмяОрганизация = "&Организация", ИмяРегистратор = "&Регистратор") Экспорт
		
	Отбор = "ИСТИНА";
	Если ИмяРегистратор <> Неопределено Тогда
		Отбор = Отбор + СтрШаблон(" И НЕ т.Регистратор В (%1)", ИмяРегистратор);
	КонецЕсли;
	
	Если ИмяВалюта = Истина Тогда
		Отбор = Отбор + " И НЕ т.ЗаписьВДополнительнойВалюте";
	ИначеЕсли ИмяВалюта <> Неопределено Тогда
		Отбор = Отбор + СтрШаблон(" И т.Валюта В (%1)", ИмяВалюта);
	КонецЕсли;
	
	Возврат 
	Новый Структура("ПериодОтчета, ВидОтчета, Организация, Отбор",
		ИмяПериодОтчета, ИмяВидОтчета, ИмяОрганизация, Отбор);

КонецФункции

Функция ТекстЗапроса_втВЗП(НомераТаблиц, ПараметрыВЗП = Неопределено, ИмяТаблицы = "втВЗП") Экспорт
	
	Если ПараметрыВЗП = Неопределено Тогда
		ПараметрыВЗП = ПараметрыВЗП();
	КонецЕсли;
	
	НомераТаблиц.Вставить(ИмяТаблицы, НомераТаблиц.Количество());

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	т.Ссылка КАК Версия,
	|	т.Регистратор КАК Регистратор,
	|	т.Организация КАК Организация,
	|	т.Сценарий КАК Сценарий,
	|	т.ПериодОтчета КАК ПериодОтчета,
	|	т.ПериодОтчета.ДатаНачала = &ДатаНачала КАК ЭтоНачало,
	|	т.ПериодОтчета.ДатаОкончания = &ДатаОкончания КАК ЭтоОкончание,
	|	т.ПериодОтчета.ДатаОкончания КАК ПериодДень,
	|	т.ВидОтчета КАК ВидОтчета,
	|	т.Валюта КАК Валюта,
	|	НЕ т.ЗаписьВДополнительнойВалюте КАК ЭтоФВ,
	|	т.ВидОперации КАК ВидОперации
	|ПОМЕСТИТЬ втВЗП
	|ИЗ
	|	Справочник.ВерсииЗначенийПоказателей КАК т
	|ГДЕ
	|	т.Сценарий В(&Сценарий)
	|	И т.ВидОтчета В(&ВидОтчета)
	|	И т.Организация В(&Организация)
	|	И т.ПериодОтчета В(&ПериодОтчета)
	|	И НЕ т.ЧерноваяВерсия
	|	И &Отбор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	т.Ссылка";
	
	Для Каждого Замена Из ПараметрыВЗП Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&" + Замена.Ключ, Замена.Значение);
	КонецЦикла;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПараметрыПС(ИмяСчетаИБ = "&СчетаИБ", ИмяВидИтогаПоСчету = "&ВидИтогаПоСчету", УсловиеПоказателей = "ИСТИНА", 
	УсловиеСчетов = "ИСТИНА", ВидСубконтоОтбор = "НЕОПРЕДЕЛЕНО") Экспорт
	
	Если ИмяСчетаИБ <> Неопределено Тогда
		УсловиеПоказателей = УсловиеПоказателей + СтрШаблон(" И т.СчетБД В (%1)", ИмяСчетаИБ);
	КонецЕсли;
	
	Если ИмяВидИтогаПоСчету <> Неопределено Тогда
		УсловиеПоказателей = УсловиеПоказателей + СтрШаблон(" И т.ВидИтогаПоСчету В (%1)", ИмяВидИтогаПоСчету);
	КонецЕсли;
	
	Возврат 
		Новый Структура("УсловиеПоказателей, УсловиеСчетов, ВидСубконтоОтбор",
			УсловиеПоказателей, УсловиеСчетов, ВидСубконтоОтбор);

КонецФункции

Функция ТекстЗапроса_втПС(НомераТаблиц, ПараметрыПС = Неопределено, ИмяТаблицы = "втПоказателиОтчета") Экспорт
	
	Если ПараметрыПС = Неопределено Тогда
		ПараметрыПС = ПараметрыПС();
	КонецЕсли;
	
	НомераТаблиц.Вставить(ИмяТаблицы, НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	п.ПоказательОтчета КАК ПоказательОтчета,
	|	п.СчетСсылка КАК СчетСсылка,
	|	п.СчетБД КАК СчетИБ,
	|	п.ВидИтогаПоСчету КАК ВидИтогаПоСчету,
	|	п.ТипОстаткаКонНач КАК ТипОстаткаКонНач,
	|	п.БухТипДтКт КАК БухТипДтКт,
	|	п.НомерАналитикиВидыДвижений КАК НомерАналитикиВидыДвижений,
	|	п.НомерАналитикиВидСубконтоОтбор КАК НомерАналитикиВидСубконтоОтбор,
	|	п.НомерРегистра КАК НомерРегистра,
	|	п.ВидАналитики1 КАК ВидАналитики1,
	|	п.ВидАналитики2 КАК ВидАналитики2,
	|	п.ВидАналитики3 КАК ВидАналитики3
	|ПОМЕСТИТЬ втПоказателиОтчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		т.Ссылка КАК ПоказательОтчета,
	|		т.СчетБД.СчетСсылка КАК СчетСсылка,
	|		т.СчетБД КАК СчетБД,
	|		т.ВидИтогаПоСчету КАК ВидИтогаПоСчету,
	|		ВЫБОР
	|			КОГДА т.ВидИтогаПоСчету В (ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.СКД), ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.СКК))
	|				ТОГДА ИСТИНА
	|			КОГДА т.ВидИтогаПоСчету В (ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.СНД), ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.СНК))
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК ТипОстаткаКонНач,
	|		ВЫБОР
	|			КОГДА т.ВидИтогаПоСчету В (ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.СКД), ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.ДО), ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.СНД))
	|				ТОГДА ИСТИНА
	|			КОГДА т.ВидИтогаПоСчету В (ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.СКК), ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.КО), ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.СНК))
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК БухТипДтКт,
	|		ВЫБОР
	|			КОГДА т.СчетБД.ДетализацияКорреспонденцииСчета В (ЗНАЧЕНИЕ(Перечисление.СпособыДетализацииКорреспонденцииСчета.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.СпособыДетализацииКорреспонденцииСчета.НеРаскрывать))
	|				ТОГДА 0
	|			КОГДА НЕ т.ВидИтогаПоСчету В (ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.ДО), ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.КО))
	|				ТОГДА 0
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики1.ПредставлениеТипа ПОДОБНО ""%Справочник.ВидыДвижений%""
	|				ТОГДА 1
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики2.ПредставлениеТипа ПОДОБНО ""%Справочник.ВидыДвижений%""
	|				ТОГДА 2
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики3.ПредставлениеТипа ПОДОБНО ""%Справочник.ВидыДвижений%""
	|				ТОГДА 3
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики4.ПредставлениеТипа ПОДОБНО ""%Справочник.ВидыДвижений%""
	|				ТОГДА 4
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики5.ПредставлениеТипа ПОДОБНО ""%Справочник.ВидыДвижений%""
	|				ТОГДА 5
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики6.ПредставлениеТипа ПОДОБНО ""%Справочник.ВидыДвижений%""
	|				ТОГДА 6
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НомерАналитикиВидыДвижений,
	|		ВЫБОР &ВидСубконтоОтбор
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики1
	|				ТОГДА 1
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики2
	|				ТОГДА 2
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики3
	|				ТОГДА 3
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики4
	|				ТОГДА 4
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики5
	|				ТОГДА 5
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики6
	|				ТОГДА 6
	|		КОНЕЦ КАК НомерАналитикиВидСубконтоОтбор,
	|		ВЫБОР
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики6 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 6
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики5 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 5
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики4 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 4
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики3 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 3
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики2 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 2
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики1 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 1
	|			КОГДА т.Владелец.ВидАналитики6 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 6
	|			КОГДА т.Владелец.ВидАналитики5 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 5
	|			КОГДА т.Владелец.ВидАналитики4 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 4
	|			КОГДА т.Владелец.ВидАналитики3 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 3
	|			КОГДА т.Владелец.ВидАналитики2 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 2
	|			КОГДА т.Владелец.ВидАналитики1 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НомерРегистра,
	|		т.ГруппаРаскрытия.ВидАналитики1 КАК ВидАналитики1,
	|		т.ГруппаРаскрытия.ВидАналитики2 КАК ВидАналитики2,
	|		т.ГруппаРаскрытия.ВидАналитики3 КАК ВидАналитики3,
	|		т.ГруппаРаскрытия.ВидАналитики4 КАК ВидАналитики4,
	|		т.ГруппаРаскрытия.ВидАналитики5 КАК ВидАналитики5,
	|		т.ГруппаРаскрытия.ВидАналитики6 КАК ВидАналитики6
	|	ИЗ
	|		Справочник.ПоказателиОтчетов КАК т
	|	ГДЕ
	|		т.Владелец В(&ВидОтчета)
	|		И т.СчетБД <> ЗНАЧЕНИЕ(Справочник.СчетаБД.ПустаяСсылка)
	|		И т.ВидИтогаПоСчету <> ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.ПустаяСсылка)
	|		И &УсловиеПоказателей
	|	{ГДЕ
	|		т.СчетБД.* КАК СчетБД}) КАК п
	|ГДЕ
	|	&УсловиеСчетов
	|	И ВЫБОР
	|			КОГДА &ВидСубконтоОтбор В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ п.НомерАналитикиВидСубконтоОтбор ЕСТЬ NULL
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	п.ПоказательОтчета,
	|	п.НомерРегистра,
	|	ТипОстаткаКонНач";

	Для Каждого Замена Из ПараметрыПС Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&" + Замена.Ключ, Замена.Значение);
	КонецЦикла;

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПараметрыЗПС(ИсключитьПромежуточныеИтоги = Ложь, ИмяТаблицы = "ОстаткиАОСВ", 
	ТипТаблицы = "Остатки", ПоляРесурсов = "СуммаВВалютеУчетаОстаток", 
	ВыраженияРесурсов = Неопределено) Экспорт
	
	Если ВыраженияРесурсов = Неопределено Тогда
		ВыраженияРесурсов = ВыраженияРесурсовМСФО();
	КонецЕсли;
	
	Возврат Новый Структура(
		"ИсключитьПромежуточныеИтоги, ИмяТаблицы, ТипТаблицы, ПоляРесурсов, ВыраженияРесурсов", 
		ИсключитьПромежуточныеИтоги, ИмяТаблицы,ТипТаблицы, ПоляРесурсов, ВыраженияРесурсов);

КонецФункции

Функция ТекстЗапроса_ДанныеАОСВ(ТекстЗапроса, ПараметрыЗПС = Неопределено) Экспорт

	Если ПараметрыЗПС = Неопределено Тогда
		ПараметрыЗПС = ПараметрыЗПС();
	КонецЕсли;
	
	ТекстЗПС = ТекстЗапроса_ЗПС(ПараметрыЗПС);
	ШаблонРесурсов = ШаблонПолейРесурсов(ПараметрыЗПС);
	ТекстЗПС = СтрЗаменить(ТекстЗПС, "ВЫБРАТЬ", "ВЫБРАТЬ " + ШаблонРесурсов + ", ");

	Возврат СтрЗаменить(ТекстЗапроса, ПараметрыЗПС.ИмяТаблицы, "(" + ТекстЗПС + ")");
	
КонецФункции

#КонецОбласти

#Область МаксСубконтоМСФО

Процедура ЗаменитьМаксСубконто(ТекстЗапроса, ЗаменыПараметров, МаксСубконтоМСФО = Неопределено, ИмяПланаСчетов = "МСФО", ЭтоМСФО = Неопределено) Экспорт
	
	Если МаксСубконтоМСФО = Неопределено Тогда
		
		Если ЭтоМСФО <> Неопределено Тогда
			ИмяПланаСчетов = ?(ЭтоМСФО, "МСФО", "Хозрасчетный");
		КонецЕсли;
		
		МаксСубконтоМСФО = УчетМСФОПовтИспУХ.ПолучитьМаксКоличествоСубконто(ИмяПланаСчетов);
		
	КонецЕсли;
	
	Есть4 = МаксСубконтоМСФО > 3;
	
	Если ТипЗнч(ЗаменыПараметров) = Тип("Строка") Тогда
		ЗаменыПараметров = Новый Структура(ЗаменыПараметров);
	КонецЕсли;
	
	Для каждого _ Из ЗаменыПараметров Цикл
		
		Замена = _.Значение;
		Если Есть4 Тогда
			Если Не ЗначениеЗаполнено(Замена) Тогда
				Замена = СтрЗаменить(_.Ключ, "_", ".");
			КонецЕсли;
		ИначеЕсли Не ЗначениеЗаполнено(Замена) Тогда
			Замена = "НЕОПРЕДЕЛЕНО";
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&" + _.Ключ, Замена);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Запрос_АОСВ

Функция ТекстЗапроса_ЗПС(ПараметрыЗПС = Неопределено)

	Если ПараметрыЗПС = Неопределено Тогда
		ПараметрыЗПС = ПараметрыЗПС();
	КонецЕсли;
	
	ТекстЗапроса = Новый Массив;
	
	МаксАналитик = 6;
	
	Для й = 0 По МаксАналитик Цикл
		ТекстЗапроса.Добавить(Шаблон_ЗначенияПоказателей(
			й, МаксАналитик, ПараметрыЗПС.ИсключитьПромежуточныеИтоги));
	КонецЦикла;
	
	Возврат СтрСоединить(ТекстЗапроса, " ОБЪЕДИНИТЬ ВСЕ ");

КонецФункции

Функция Шаблон_ЗначенияПоказателей(ЧислоАналитик = 6, МаксАналитик = 6, ИсключатьПромежуточныеИтоги = Истина)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	втВЗП.Сценарий КАК Сценарий,
	|	втВЗП.Организация КАК Организация,
	|	втВЗП.ВидОперации КАК ВидОперации,
	|	втВЗП.ПериодДень КАК ПериодДень,
	|	втВЗП.ПериодОтчета КАК ПериодОтчета,
	|	втВЗП.ЭтоФВ КАК ЭтоФВ,
	|	втВЗП.Регистратор КАК Регистратор,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	п.СчетСсылка КАК СчетСсылка,
	|	п.СчетИБ КАК СчетИБ,
	|	п.ВидАналитики1 КАК ВидСубконто1,
	|	п.ВидАналитики2 КАК ВидСубконто2,
	|	п.ВидАналитики3 КАК ВидСубконто3,
	|	п.ТипОстаткаКонНач КАК ТипОстаткаКонНач,
	|	п.БухТипДтКт КАК БухТипДтКт,
	|	ВЫБОР
	|		КОГДА втВЗП.ЭтоФВ
	|			ТОГДА т.ЗначениеВалюта
	|	КОНЕЦ КАК ЗначениеВалюта,
	|	ВЫБОР п.НомерАналитикиВидыДвижений
	|		КОГДА 1
	|			ТОГДА т.Аналитика1
	|		КОГДА 2
	|			ТОГДА т.Аналитика2
	|		КОГДА 3
	|			ТОГДА т.Аналитика3
	|		КОГДА 4
	|			ТОГДА т.Аналитика4
	|		КОГДА 5
	|			ТОГДА т.Аналитика5
	|		КОГДА 6
	|			ТОГДА т.Аналитика6
	|	КОНЕЦ КАК ВидДвижения,
	|	ВЫБОР п.НомерАналитикиВидСубконтоОтбор
	|		КОГДА 1
	|			ТОГДА т.Аналитика1
	|		КОГДА 2
	|			ТОГДА т.Аналитика2
	|		КОГДА 3
	|			ТОГДА т.Аналитика3
	|		КОГДА 4
	|			ТОГДА т.Аналитика4
	|		КОГДА 5
	|			ТОГДА т.Аналитика5
	|		КОГДА 6
	|			ТОГДА т.Аналитика6
	|	КОНЕЦ КАК ВидСубконтоОтбор,
	|	т.Показатель КАК ПоказательОтчета,
	|	т.Значение КАК Значение,
	|	т.АналитикаВалюта КАК Валюта,
	|	т.Аналитика1 КАК Субконто1,
	|	т.Аналитика2 КАК Субконто2,
	|	т.Аналитика3 КАК Субконто3,
	|	т.Аналитика4 КАК Субконто4,
	|	т.Аналитика5 КАК Субконто5,
	|	т.Аналитика6 КАК Субконто6
	|ИЗ
	|	РегистрСведений.ЗначенияПоказателейОтчетов6 КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПоказателиОтчета КАК п
	|		ПО т.Показатель = п.ПоказательОтчета
	|			И (п.НомерРегистра = &НомерРегистра)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВЗП КАК втВЗП
	|		ПО т.Версия = втВЗП.Версия
	|ГДЕ
	|	НЕ т.ИтоговоеЗначение
	|	И &ПромежуточныеИтоги";
	
	ПромежуточныеИтоги = "ИСТИНА";
	Если ИсключатьПромежуточныеИтоги Тогда
		
		ПромежуточныеИтоги = 
		"ВЫБОР
		|			КОГДА втВЗП.ЭтоОкончание
		|					И втВЗП.ЭтоНачало
		|				ТОГДА ИСТИНА
		|			КОГДА п.ТипОстаткаКонНач = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			КОГДА НЕ втВЗП.ЭтоОкончание
		|					И НЕ втВЗП.ЭтоНачало
		|				ТОГДА ЛОЖЬ
		|			КОГДА НЕ втВЗП.ЭтоОкончание
		|					И втВЗП.ЭтоНачало
		|				ТОГДА п.ТипОстаткаКонНач = ЛОЖЬ
		|			ИНАЧЕ п.ТипОстаткаКонНач = ИСТИНА
		|		КОНЕЦ";
		
	КонецЕсли;
	
	ИмяРегистра = "ЗначенияПоказателейОтчетов" + ЧислоАналитик;
	Если ЧислоАналитик = 0 Тогда
		ИмяРегистра = "ЗначенияПоказателейОтчетовСинтетика";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "т.ИтоговоеЗначение", "ЛОЖЬ");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "т.ЗначениеВалюта", "т.Значение");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "т.АналитикаВалюта", "втВЗП.Валюта");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПромежуточныеИтоги", ПромежуточныеИтоги);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗначенияПоказателейОтчетов6", ИмяРегистра);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НомерРегистра", ЧислоАналитик);
	
	Для й = ЧислоАналитик + 1 По МаксАналитик Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "т.Аналитика" + й, "NULL");
	КонецЦикла;
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ШаблонПолейРесурсов(ПараметрыЗПС)
	
	ТипТаблицы			= ПараметрыЗПС.ТипТаблицы;
	ПоляРесурсов		= Новый Структура(ПараметрыЗПС.ПоляРесурсов);
	ВыраженияРесурсов	= ПараметрыЗПС.ВыраженияРесурсов;
	
	Ресурсы = Новый Массив;
	Для каждого ПолеРесурса Из ПоляРесурсов Цикл
		
		ВыражениеРесурса = Неопределено;
		Для каждого ТекущийРесурс Из ВыраженияРесурсов Цикл
			Если СтрНачинаетсяС(ПолеРесурса.Ключ, ТекущийРесурс.Ключ) Тогда
				ВыражениеРесурса = ТекущийРесурс.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Суффикс = СтрЗаменить(ПолеРесурса.Ключ, ТекущийРесурс.Ключ, "");
		Ресурсы.Добавить(ВыражениеПоляРесурсаАОСВ(
			ПолеРесурса.Ключ, ВыражениеРесурса, Суффикс, ПараметрыЗПС));
		
	КонецЦикла;

	Возврат СтрСоединить(Ресурсы, ",");
	
КонецФункции

Функция ВыраженияРесурсовМСФО()

	Возврат Новый Структура(
		"СуммаВВалютеУчета, СуммаВВалютеОтчетности, СуммаВВалюте, Количество",
			"ВЫБОР КОГДА тОСВ.ЭтоФВ ТОГДА т.Значение КОНЕЦ",
			"ВЫБОР КОГДА тОСВ.ЭтоВО ТОГДА т.Значение КОНЕЦ",
			"ВЫБОР КОГДА тОСВ.ЭтоФВ ТОГДА т.ЗначениеВалюта КОНЕЦ",
			"0");
	
КонецФункции

Функция ВыражениеПоляРесурсаАОСВ(ПолеРесурса, ВыражениеРесурса, СуффиксПоля, ПараметрыЗПС)

	ТипОстаткаКонНач = ТипОстаткаКонНач(СуффиксПоля);
	БухТипДтКт = БухТипДтКт(СуффиксПоля);
	//Развернутый = СтрНайти(СуффиксПоля, "Развернутый") > 0;
	
	ТекстКогда = "";
	ТекстТогда = ВыражениеРесурса;
	
	Если ТекстКогда = "" Тогда
		
		ТекстЗапроса = " (%2) КАК %1";
		Возврат СтрШаблон(ТекстЗапроса,
			ПолеРесурса, ТекстТогда);
		
	КонецЕсли;
	
	ТекстЗапроса =
	" (ВЫБОР
	|			КОГДА %4
	|				ТОГДА %3
	|		КОНЕЦ) КАК %1";
		
	Возврат СтрШаблон(ТекстЗапроса, 
		ПолеРесурса, ТекстТогда, ТекстКогда);
	
КонецФункции

Функция ТипОстаткаКонНач(СуффиксПоля)
	
	ТипОстаткаКонНач = "";//Остаток
	Если СтрНачинаетсяС(СуффиксПоля, "Конечный") Тогда
		ТипОстаткаКонНач = "ИСТИНА";
	ИначеЕсли СтрНачинаетсяС(СуффиксПоля, "Начальный") Тогда
		ТипОстаткаКонНач = "ЛОЖЬ";
	ИначеЕсли СтрНачинаетсяС(СуффиксПоля, "Оборот") Тогда
		ТипОстаткаКонНач = "НЕОПРЕДЕЛЕНО";
	КонецЕсли;
	
	Возврат ТипОстаткаКонНач;

КонецФункции

Функция БухТипДтКт(СуффиксПоля)
	
	БухТипДтКт = "";
	Если СтрЗаканчиваетсяНа(СуффиксПоля, "Дт") Тогда
		БухТипДтКт = "ИСТИНА";
	ИначеЕсли СтрЗаканчиваетсяНа(СуффиксПоля, "Кт") Тогда
		БухТипДтКт = "ЛОЖЬ";
	Иначе 
		БухТипДтКт = "НЕОПРЕДЕЛЕНО";
	КонецЕсли;

	Возврат БухТипДтКт;
	
КонецФункции

#КонецОбласти

#Область Запрос_Распределение

Функция ТекстЗапроса_втНеточностиРаспределений(НастройкиРаспределения, ИмяТаблицыДо, ИмяТаблицыНеточности)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&ИменаГруппировок КАК ИмяГруппировки,
	|	&Сумма_Неточность КАК Сумма_Неточность,
	|	МАКСИМУМ(т.ПолеНомерРаспределения) КАК ПолеНомерРаспределения
	|ПОМЕСТИТЬ ИмяТаблицыНеточности
	|ИЗ
	|	ИмяТаблицыДо КАК т
	|
	|СГРУППИРОВАТЬ ПО
	|	т.СгруппироватьПо
	|
	|ИМЕЮЩИЕ
	|	&ИМЕЮЩИЕ = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПолеНомерРаспределения";
	
	Неточности = Новый Массив;
	ТекстИмеющие = Новый Массив;
	Для каждого ПутьСуммы Из СтрРазделить(НастройкиРаспределения.ПутиСумм, ";", Ложь) Цикл
		
		ЧастиПути = СтрРазделить(ПутьСуммы, ":");
		
		Шаблон = "ЕстьNULL(МАКСИМУМ(%1), 0) - ЕстьNULL(СУММА(%2), 0) КАК %2";
		Неточности.Добавить(СтрШаблон(Шаблон, ЧастиПути[1], ЧастиПути[0]));
		
		Шаблон = "ЕстьNULL(МАКСИМУМ(%1), 0) - ЕстьNULL(СУММА(%2), 0) <> 0";
		ТекстИмеющие.Добавить(СтрШаблон(Шаблон, ЧастиПути[1], ЧастиПути[0]));
		
	КонецЦикла;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Сумма_Неточность",		СтрСоединить(Неточности, ", ") + ", NULL");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИменаГруппировок",		НастройкиРаспределения.ИменаГруппировок + ", NULL");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "т.СгруппироватьПо",		НастройкиРаспределения.ИменаГруппировок);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИМЕЮЩИЕ = ИСТИНА",		СтрСоединить(ТекстИмеющие, " ИЛИ "));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПолеНомерРаспределения",	НастройкиРаспределения.ПолеНомерРаспределения);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяТаблицыДо",			ИмяТаблицыДо);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяТаблицыНеточности",	ИмяТаблицыНеточности);
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапроса_втРезультатыРаспределений(НастройкиРаспределения, ИмяТаблицыРезультат, ИмяТаблицыДо, ИмяТаблицыНеточности)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&ВсеПоля КАК ВсеПоля
	|ПОМЕСТИТЬ ИмяТаблицыРезультат
	|ИЗ
	|	ИмяТаблицыДо КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИмяТаблицыНеточности КАК Неточность
	|		ПО т.ПолеНомерРаспределения = Неточность.ПолеНомерРаспределения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИменаГруппировок";
	
	ИменаГруппировок = Новый Массив;
	Для каждого ИмяГруппировки Из СтрРазделить(НастройкиРаспределения.ИменаГруппировок, ",") Цикл
		ИменаГруппировок.Добавить("т." + СокрЛП(ИмяГруппировки));
	КонецЦикла;
	
	Неточности = Новый Массив;
	Для каждого ПутьСуммы Из СтрРазделить(НастройкиРаспределения.ПутиСумм, ";", Ложь) Цикл
		Шаблон = "ЕстьNULL(т.%1, 0) + ЕстьNULL(Неточность.%1, 0) КАК %1";
		ЧастиПути = СтрРазделить(ПутьСуммы, ":");
		Неточности.Добавить(СтрШаблон(Шаблон, ЧастиПути[0]));
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИменаГруппировок",		СтрСоединить(ИменаГруппировок, ", "));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВсеПоля",				СтрСоединить(Неточности, ", ") + ", *, NULL");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяТаблицыРезультат",		ИмяТаблицыРезультат);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяТаблицыДо",			ИмяТаблицыДо);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяТаблицыНеточности",	ИмяТаблицыНеточности);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПолеНомерРаспределения",	НастройкиРаспределения.ПолеНомерРаспределения);
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область Запрос_Трансляция

#Область ТекстЗапроса_ПередЗапросомТрансляцией

Функция ТекстЗапроса_втСоответствияТрансляции(НомераТаблиц, ТекстЗапросаСчетаИсточники = Неопределено)

	НомераТаблиц.Вставить("втСоответствияТрансляции", НомераТаблиц.Количество());
	
	//Справочник.СоответствияСчетовДляТрансляции - 
	//Справочник.ИсточникиДанныхДляРасчетов
	//Справочник.ГруппыРаскрытия
	//РегистрСведений.НастройкиПравилТрансляции
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Соотв.СчетПриемник КАК СчетПриемник,
	|	Соотв.СчетИсточник КАК СчетИсточник,
	|	Соотв.Ссылка КАК Соотв,
	|	ИД.Ссылка КАК ИД,
	|	ИД.ТрансляцияДебет КАК ТрансляцияДебет,
	|	ИД.ТрансляцияКредит КАК ТрансляцияКредит,
	|	ИД.КоррСчет <> ЗНАЧЕНИЕ(Справочник.СчетаБД.ПустаяСсылка) КАК ПрименениеПоКорреспонденции,
	|	НастройкиПравилТрансляции.КоррСчетИсточник КАК КоррСчетИсточник,
	|	ИД.КоррСчет КАК КоррСчет
	|ПОМЕСТИТЬ втСоответствияТрансляции
	|ИЗ
	|	Справочник.СоответствияСчетовДляТрансляции КАК Соотв
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсточникиДанныхДляРасчетов КАК ИД
	|		ПО Соотв.Ссылка = ИД.ПотребительРасчета
	|			И (ВЫРАЗИТЬ(ИД.НазначениеРасчетов КАК Справочник.ПравилаОбработки).Владелец В (&ШаблонТрансляции))
	|			И (НЕ ИД.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПравилТрансляции КАК НастройкиПравилТрансляции
	|		ПО Соотв.Ссылка = НастройкиПравилТрансляции.СоответствиеСчетов
	|ГДЕ
	|	Соотв.СчетИсточник В(&СчетаИсточники)
	|	И Соотв.Владелец В (&ШаблонТрансляции)
	|	И НЕ Соотв.ПометкаУдаления
	|	И НЕ Соотв.НеТранслировать
	|	И Соотв.СчетПриемник.СчетСсылка <> НЕОПРЕДЕЛЕНО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД";
	
	Если ТекстЗапросаСчетаИсточники <> Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СчетаИсточники", ТекстЗапросаСчетаИсточники);
	КонецЕсли;
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапроса_втПолучениеПолей(НомераТаблиц)

	НомераТаблиц.Вставить("втПолучениеПолей", НомераТаблиц.Количество());
	
	//ПОДСТРОКА("СубконтоДт2.Код",11,1) = "2"
	//ПОДСТРОКА("Аналитика2",10,1) = "2"
	//ПОДСТРОКА(МАКСИМУМ(Получение.Поле),11,2) = ПОДСТРОКА(МАКСИМУМ(Получение.КодАналитики),10,2) - субконто номер-в-номер 
	
	//Виды получения полей:
	//ИСТИНА - 1в1, 			например П.Субконто2 = И.Субконто2
	//"Субконто2.Родитель", 	например П.Субконто2 = И.Субконто2.Родитель
	//Ссылка, 					например П.Субконто2 = втПолучениеПолей.Субконто2
	//NULL(нет заполнения), 	например П.Субконто2 = NULL
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	втСоотв.СчетПриемник КАК СчетПриемник,
	|	втСоотв.СчетИсточник КАК СчетИсточник,
	|	втСоотв.Соотв КАК Соотв,
	|	втСоотв.ИД КАК ИД,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(Получение.Поле) = Получение.КодАналитики
	|			ТОГДА ИСТИНА
	|		КОГДА ПОДСТРОКА(МАКСИМУМ(Получение.Поле), 11, 2) = ПОДСТРОКА(МАКСИМУМ(Получение.КодАналитики), 10, 2)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ МАКСИМУМ(Получение.Поле)
	|	КОНЕЦ КАК ПолеИсточник,
	|	Получение.КодАналитики КАК ПолеПриемник
	|ПОМЕСТИТЬ втПолучениеПолей
	|ИЗ
	|	втСоответствияТрансляции КАК втСоотв
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсточникиДанныхДляРасчетов.ПравилаИспользованияПолейЗапроса КАК Получение
	|		ПО втСоотв.ИД = Получение.Ссылка
	|ГДЕ
	|	ПОДСТРОКА(Получение.КодАналитики, 0, 2) В (""&Аналитика"", ""&Подразделение"", ""&НаправлениеДеятельности"")
	|	И Получение.Поле <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	втСоотв.СчетПриемник,
	|	втСоотв.СчетИсточник,
	|	втСоотв.Соотв,
	|	втСоотв.ИД,
	|	Получение.КодАналитики
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД,
	|	ПолеПриемник";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&" + "Аналитика", Лев("Аналитика", 2) );
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&" + "Подразделение", Лев("Подразделение", 2) );
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&" + "НаправлениеДеятельности", Лев("НаправлениеДеятельности", 2) );
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_втПравилаПолей(НомераТаблиц)
	
	НомераТаблиц.Вставить("втПравилаПолей", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	втСоотв.СчетПриемник КАК СчетПриемник,
	|	втСоотв.СчетПриемник.СчетСсылка КАК СчетПриемникСсылка,
	|	втСоотв.СчетИсточник КАК СчетИсточник,
	|	втСоотв.СчетИсточник.СчетСсылка КАК СчетИсточникСсылка,
	|	втСоотв.Соотв КАК Соотв,
	|	втСоотв.ИД КАК ИД,
	|	ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА КАК ЕстьОтбор
	|		ИЗ
	|			втЗначенияОтборовТрансляции КАК втЗначенияОтборовТрансляции
	|		ГДЕ
	|			втЗначенияОтборовТрансляции.ИД = втСоотв.ИД) КАК ЕстьОтборы,
	|	втСоотв.ТрансляцияДебет КАК ТрансляцияДебет,
	|	втСоотв.ТрансляцияКредит КАК ТрансляцияКредит,
	|	втСоотв.ПрименениеПоКорреспонденции КАК ПрименениеПоКорреспонденции,
	|	втСоотв.КоррСчет КАК КоррСчет,
	|	втСоотв.КоррСчет.СчетСсылка КАК КоррСчетСсылка,
	|	ПолеПодразделение.ПолеИсточник КАК Подразделение,
	|	ПолеНаправлениеДеятельности.ПолеИсточник КАК НаправлениеДеятельности,
	|	ПолеВалюта.ПолеИсточник КАК Валюта,
	|	ПолеСубконто1.ПолеИсточник КАК Субконто1,
	|	ПолеСубконто2.ПолеИсточник КАК Субконто2,
	|	ПолеСубконто3.ПолеИсточник КАК Субконто3,
	|	ПолеСубконто4.ПолеИсточник КАК Субконто4,
	|	втСоотв.СчетПриемник.Вид <> ЗНАЧЕНИЕ(Перечисление.ВидыСчетовБД.Пассивный) КАК ЭтоАктив,
	|	ЕСТЬNULL(втСоотв.СчетПриемник.СчетСсылка.Количественный, ЛОЖЬ) КАК Количественный,
	|	втСоотв.СчетПриемник.Валютный КАК Валютный,
	|	ЕСТЬNULL(втСоотв.СчетПриемник.СчетСсылка.УчетПоПодразделениям, ЛОЖЬ) КАК УчетПоПодразделениям,
	|	ЕСТЬNULL(втСоотв.СчетПриемник.СчетСсылка.УчетПоНаправлениямДеятельности, ЛОЖЬ) КАК УчетПоНаправлениямДеятельности,
	|	ЕСТЬNULL(Вид1.ВидСубконтоСсылка, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)) КАК ВидСубконто1,
	|	ЕСТЬNULL(Вид2.ВидСубконтоСсылка, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)) КАК ВидСубконто2,
	|	ЕСТЬNULL(Вид3.ВидСубконтоСсылка, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)) КАК ВидСубконто3,
	|	ЕСТЬNULL(Вид4.ВидСубконтоСсылка, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)) КАК ВидСубконто4
	|ПОМЕСТИТЬ втПравилаПолей
	|ИЗ
	|	втСоответствияТрансляции КАК втСоотв
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПолучениеПолей КАК ПолеПодразделение
	|		ПО втСоотв.ИД = ПолеПодразделение.ИД
	|			И (ПолеПодразделение.ПолеПриемник = ""Подразделение"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПолучениеПолей КАК ПолеНаправлениеДеятельности
	|		ПО втСоотв.ИД = ПолеНаправлениеДеятельности.ИД
	|			И (ПолеНаправлениеДеятельности.ПолеПриемник = ""НаправлениеДеятельности"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПолучениеПолей КАК ПолеВалюта
	|		ПО втСоотв.ИД = ПолеВалюта.ИД
	|			И (ПолеВалюта.ПолеПриемник = ""Валюта"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПолучениеПолей КАК ПолеСубконто1
	|		ПО втСоотв.ИД = ПолеСубконто1.ИД
	|			И (ПолеСубконто1.ПолеПриемник = ""Аналитика1"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПолучениеПолей КАК ПолеСубконто2
	|		ПО втСоотв.ИД = ПолеСубконто2.ИД
	|			И (ПолеСубконто2.ПолеПриемник = ""Аналитика2"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПолучениеПолей КАК ПолеСубконто3
	|		ПО втСоотв.ИД = ПолеСубконто3.ИД
	|			И (ПолеСубконто3.ПолеПриемник = ""Аналитика3"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПолучениеПолей КАК ПолеСубконто4
	|		ПО втСоотв.ИД = ПолеСубконто4.ИД
	|			И (ПолеСубконто4.ПолеПриемник = ""Аналитика4"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК Вид1
	|		ПО втСоотв.СчетПриемник = Вид1.Ссылка
	|			И (Вид1.Номер = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК Вид2
	|		ПО втСоотв.СчетПриемник = Вид2.Ссылка
	|			И (Вид2.Номер = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК Вид3
	|		ПО втСоотв.СчетПриемник = Вид3.Ссылка
	|			И (Вид3.Номер = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК Вид4
	|		ПО втСоотв.СчетПриемник = Вид4.Ссылка
	|			И (Вид4.Номер = 4)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетИсточникСсылка,
	|	ПрименениеПоКорреспонденции,
	|	ЕстьОтборы,
	|	КоррСчетСсылка";

КонецФункции

Функция ТекстЗапроса_втОтборыПолей(НомераТаблиц)

	НомераТаблиц.Вставить("втОтборыПолей", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
	|	ОтборБД.НомерСтроки КАК НомерСтроки,
	|	ОтборБД.ПолеБД КАК ПолеБД,
	|	ОтборБД.ИмяПараметра КАК ИмяПараметра,
	|	ОтборБД.Ссылка КАК ИД,
	|	втСпособыВычисления.ЭтоНе КАК ЭтоНе,
	|	втСпособыВычисления.СписокИерархия КАК СписокИерархия 
	|ПОМЕСТИТЬ втОтборыПолей
	|ИЗ
	|	Справочник.ИсточникиДанныхДляРасчетов.ТаблицаПараметровОтбораБД КАК ОтборБД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСоответствияТрансляции КАК втСоотв
	|		ПО ОтборБД.Ссылка = втСоотв.ИД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСпособыВычисления КАК втСпособыВычисления
	|		ПО ОтборБД.СпособВычисленияПараметра = втСпособыВычисления.Способ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД,
	|	НомерЗаписи,
	|	ИмяПараметра";

КонецФункции

Функция ТекстЗапроса_втЗначенияОтборовТрансляции(НомераТаблиц)

	НомераТаблиц.Вставить("втЗначенияОтборовТрансляции", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	втСоотв.ИД КАК ИД,
	|	т.ИмяПараметра КАК ИмяПараметра,
	|	т.Значение КАК Значение
	|ПОМЕСТИТЬ втЗначенияОтборовТрансляции
	|ИЗ
	|	Справочник.ИсточникиДанныхДляРасчетов.УточненияСпособовОпределения КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСоответствияТрансляции КАК втСоотв
	|		ПО т.Ссылка = втСоотв.ИД
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД,
	|	ИмяПараметра";

КонецФункции

#КонецОбласти

#Область ЗаменаПараметровЗапросаТрансляции

Процедура ПодготовитьКэшТрансляции(Процессор)
	
	Если Процессор.ШаблонТрансляции = Неопределено Тогда
		Процессор.ШаблонТрансляции = МСФОВызовСервераУХ.ЗначениеУП(
			"ШаблонТрансляции", Справочники.Организации.ПустаяСсылка());
	КонецЕсли;
	
	КэшТрансляции = УчетМСФОПовтИспУХ.НастройкиШаблонаТрансляции(Процессор.ШаблонТрансляции);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Процессор, КэшТрансляции, Истина);

КонецПроцедуры

Процедура УдалитьПутиИсключения(Процессор)
	
	Если Не ЗначениеЗаполнено(Процессор.ПутиИсключения) Тогда
		Возврат;
	КонецЕсли;
	
	//исключаем путь вида "Регистратор.Валюта" по исключению "Регистратор"
	
	ЧислоПутей = Процессор.ДоступныеПути.Количество();
	Для й = 1 По ЧислоПутей Цикл
		
		ТекущийПуть = Процессор.ДоступныеПути.Получить(ЧислоПутей-й);
		ТекущийПуть = СтрРазделить(ТекущийПуть, ".")[0];
		Если Процессор.ПутиИсключения.Найти(ТекущийПуть) <> Неопределено Тогда
			Процессор.ДоступныеПути.Удалить(ЧислоПутей-й);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПодготовитьСторонуТрансляции(Процессор, ИмяТаблицыПолей = "Трансляция", ЭтоДт = Истина)

	Процессор.Вставить("СторонаИмя",		"вт" + ИмяТаблицыПолей);
	Процессор.Вставить("СторонаПрефикс",	ИмяТаблицыПолей + "_");
	Процессор.Вставить("СторонаДт",			ЭтоДт);
	Процессор.Вставить("ТекстОтбор", 		Новый Массив); // подготовка отбора 
	
КонецФункции

Процедура ДобавитьОтборОперандаТрансляции(Процессор)
	
	ПолеОтбор = Новый Массив;
	ПолеОтбор.Добавить("КОГДА ЛОЖЬ ТОГДА NULL"); // ДоступныеОтборы.Количество() = 0
	
	//Пример "ШаблонКогда":
	// КОГДА втОтборыПолей.ПолеБД = ""Субконто1.Родитель""
	// ТОГДА ВЫРАЗИТЬ(ТаблицаИсточник.СубконтоДт1 КАК Справочник.Контрагенты).Родитель
	
	ШаблонКогда = "КОГДА втОтборыПолей.ПолеБД = ""%1"" ТОГДА %2";
	
	Для каждого СтрокаТаб Из Процессор.ДоступныеОтборы Цикл
		
		СтрокаТогда = ТипизированныйПуть(Процессор, СтрокаТаб.Поле, СтрокаТаб.ТипДанных);
		Если Не ЗначениеЗаполнено(СтрокаТогда) Тогда
			//**пропущен путь
			Продолжить;
		КонецЕсли;
		
		ПолеОтбор.Добавить(СтрШаблон(ШаблонКогда, СтрокаТаб.Поле, СтрокаТогда));
		
	КонецЦикла;
	
	Шаблон = 
	"
	|
	|ВЫБОР 
	|%1 
	|КОНЕЦ
	|";
	ПолеИзПути = СтрШаблон(Шаблон, СтрСоединить(ПолеОтбор, Символы.ПС));
	
	Шаблон = Шаблон_ОтборТрансляции();
	Шаблон = СтрЗаменить(Шаблон, "&втПравилаПолей_ИД", Процессор.СторонаИмя + ".ИД");
	Шаблон = СтрЗаменить(Шаблон, "&ТаблицаИсточник_Субконто1", ПолеИзПути);
	
	Процессор.ТекстОтбор.Добавить(СтрШаблон("ИСТИНА В (%1)", Символы.ПС + Шаблон + Символы.ПС));

КонецПроцедуры

Процедура ДобавитьЗаменыПолейВыбораТрансляции(Процессор)
	
	ШаблонПоля = ШаблонПоляПриемникаТрансляции(Процессор);
	
	Для каждого ПолеПриемник Из Процессор.ПоляПриемники Цикл
		
		ИмяПоляСтороны = ?(ЗначениеЗаполнено(ПолеПриемник.Значение),
			ПолеПриемник.Значение,
			ПолеПриемник.Ключ);
		
		ПолеИсточник = "NULL";
		ПутьПоляСтороны = Процессор.СторонаИмя + "." + ИмяПоляСтороны;
		
		ИмяПоляИсточника = ОбщегоНазначенияКлиентСервер
			.СвойствоСтруктуры(Процессор.ПоляИсточники, ПолеПриемник.Ключ);

		Если Процессор.ПоляИсточники.Свойство(ИмяПоляСтороны) Тогда
			
			ПолеИсточник = Процессор.ИмяТаблицыИсточника 
				+ "." 
				+ Процессор.ПоляИсточники[ИмяПоляСтороны];
			
		ИначеЕсли (ИмяПоляСтороны <> ПолеПриемник.Ключ) И Процессор.ПоляИсточники.Свойство(ПолеПриемник.Ключ) Тогда
				
			ПолеИсточник = Процессор.ИмяТаблицыИсточника 
				+ "." 
				+ Процессор.ПоляИсточники[ПолеПриемник.Ключ];
				
		Иначе
				//** не найдено поле выбора в источнике по правилу 1в1	
		КонецЕсли;
			
		ИмяПараметра = Процессор.СторонаПрефикс + ИмяПоляСтороны;
		Процессор.ЗаменыПараметров.Вставить(
			ИмяПараметра,
			СтрШаблон(ШаблонПоля, ПутьПоляСтороны, ПолеИсточник));
		
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьОтборыСтороныТрансляции(Процессор)
	
	Если Процессор.СторонаДт Тогда
		Процессор.ТекстОтбор.Добавить(Процессор.СторонаИмя + ".ТрансляцияДебет");
	Иначе
		Процессор.ТекстОтбор.Добавить(Процессор.СторонаИмя + ".ТрансляцияКредит");
	КонецЕсли;
	
	Если Не Процессор.ПоляИсточники.Свойство("КоррСчет") Тогда
		Шаблон = " НЕ %1.ПрименениеПоКорреспонденции";
		Процессор.ТекстОтбор.Добавить(СтрШаблон(Шаблон, Процессор.СторонаИмя));
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьЗаменуОтбораТрансляции(Процессор)

	Разделитель = 
	"
	|И ";
	
	ИмяПараметра = Процессор.СторонаПрефикс + "Отбор";
	Процессор.ЗаменыПараметров.Вставить(ИмяПараметра, 
		СтрСоединить(Процессор.ТекстОтбор, Разделитель));

КонецПроцедуры

Функция ШаблонПоляПриемникаТрансляции(Процессор)
	
	ИмяТаблицыИсточника	= Процессор.ИмяТаблицыИсточника;
	ПоляИсточники 		= Процессор.ПоляИсточники;

	МассивКогда = Новый Массив;
	Для каждого п Из Процессор.ДоступныеПути Цикл
		
		//"СубконтоДт2МСФО.Владелец.ГоловнойКонтрагент" ИЗ ""СубконтоДт2.Владелец.ГоловнойКонтрагент""
		//** в пути заменить Подразделение на ПодразделениеДт
		ПутьТогда = ТипизированныйПуть(Процессор, п.Поле, п.ТипДанных);//** тип
		МассивКогда.Добавить(СтрШаблон("КОГДА ""%1"" ТОГДА %2", п.Поле, ПутьТогда));
			
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Процессор.ДоступныеПути) Тогда
		МассивКогда.Добавить("КОГДА ЛОЖЬ ТОГДА NULL");//нет трансляций
	КонецЕсли;
	
	ШаблонПоля =
	"
	|
	|ВЫБОР ТИПЗНАЧЕНИЯ(%1)
	|	КОГДА NULL 
	|		ТОГДА NULL
	|	КОГДА ТИП(БУЛЕВО) 
	|		ТОГДА %2
	|	КОГДА ТИП(СТРОКА) 
	|		ТОГДА 
	|				ВЫБОР %1 
	|					&КОГДА 
	|				КОНЕЦ
	|	ИНАЧЕ %1 
	|КОНЕЦ";
	
	Возврат СтрЗаменить(ШаблонПоля, "&КОГДА", СтрСоединить(МассивКогда, Символы.ПС));

КонецФункции

Функция Шаблон_ОтборТрансляции()
	
	//&ТаблицаИсточник_Субконто1: "ВЫБОР КОГДА ""Субконто1.Родитель"" ТОГДА ТаблицаИсточник.Субконто1.Родитель КОНЕЦ"
	//&втПравилаПолей_ИД: всегда "втПравилаПолей.ИД"
	//** "В ИЕРАРХИИ"
	
	Возврат
	"ВЫБРАТЬ
	|	МИНИМУМ(ВЫБОР
	|				КОГДА втОтборыПолей.ЭтоНе
	|					ТОГДА ПроверкаЭлементаОтбора.НомерЗаписи ЕСТЬ NULL
	|					ИНАЧЕ НЕ ПроверкаЭлементаОтбора.НомерЗаписи ЕСТЬ NULL
	|			КОНЕЦ)
	|ИЗ
	|	втОтборыПолей КАК втОтборыПолей
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОтборыПолей КАК ПроверкаЭлементаОтбора
	|		ПО втОтборыПолей.ИД = ПроверкаЭлементаОтбора.ИД
	|			И втОтборыПолей.НомерЗаписи = ПроверкаЭлементаОтбора.НомерЗаписи
	|			И (&ТаблицаИсточник_Субконто1 В
	|				(ВЫБРАТЬ
	|					втЗначенияОтборовТрансляции.Значение
	|				ИЗ
	|					втЗначенияОтборовТрансляции КАК втЗначенияОтборовТрансляции
	|				ГДЕ
	|					втЗначенияОтборовТрансляции.ИД = ПроверкаЭлементаОтбора.ИД
	|					И втЗначенияОтборовТрансляции.ИмяПараметра = втОтборыПолей.ИмяПараметра))
	|ГДЕ
	|	втОтборыПолей.ИД = &втПравилаПолей_ИД";

КонецФункции

Функция ТипизированныйПуть(Процессор, ПолныйПуть, ТипДанных)
	
	ОстатокПути = "";
	Основание = ОснованиеПути(ПолныйПуть, ОстатокПути);
	
	ОснованиеЗамена = ЗаменаОснованияПути(Процессор, Основание);
	Если Не ЗначениеЗаполнено(ОснованиеЗамена) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяТаблицы = Процессор.ИмяТаблицыИсточника;
	ОдинТипДанных = ЗначениеЗаполнено(ТипДанных) И СтрНайти(ТипДанных, ";") = 0;
	ЕстьОстаток = ЗначениеЗаполнено(ОстатокПути);
	
	Если ОдинТипДанных И ЕстьОстаток Тогда
		
		Возврат СтрШаблон("ВЫРАЗИТЬ(%1.%2 КАК %3).%4",
			ИмяТаблицы, ОснованиеЗамена, ТипДанных, ОстатокПути);
	
	Иначе
		
		Возврат СтрШаблон("%1.%2%3",
			ИмяТаблицы, ОснованиеЗамена, ?(ЕстьОстаток, "." + ОстатокПути, ""));
		
	КонецЕсли;
	
КонецФункции

Функция ОснованиеПути(ПолныйПуть, ОстатокПути = "")

	ПерваяТочка = СтрНайти(ПолныйПуть, ".");
	Если ПерваяТочка = 0 Тогда
		ОстатокПути = "";
		Возврат ПолныйПуть;
	КонецЕсли;

	ОстатокПути = Сред(ПолныйПуть, ПерваяТочка + 1);
	Возврат Лев(ПолныйПуть, ПерваяТочка - 1);

КонецФункции

Функция ЗаменаОснованияПути(Процессор, Основание)
	
	ЗаменаОснования = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Процессор.ПоляИсточники, Основание);
		
	Если ЗначениеЗаполнено(ЗаменаОснования) Тогда
		Возврат ЗаменаОснования;
	КонецЕсли;
	
	Сторона = ?(Процессор.СторонаДт, "Дт", "Кт"); // Для Подразделение - Подразделение
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Процессор.ПоляИсточники, Основание + Сторона);
	
КонецФункции

Функция ПоляПриемникиТрансляции()

	Результат = Новый Структура;
	
	Результат.Вставить("Субконто1");
	Результат.Вставить("Субконто2");
	Результат.Вставить("Субконто3");
	Результат.Вставить("Подразделение");
	Результат.Вставить("НаправлениеДеятельности");

	Возврат Результат;
	
КонецФункции

Функция ПоляИсточникаТрансляции()
	
	Результат = Новый Структура;
	
	Результат.Вставить("СчетДт", 					"СчетДт");
	Результат.Вставить("СубконтоДт1",				"СубконтоДт1");
	Результат.Вставить("СубконтоДт2",				"СубконтоДт2");
	Результат.Вставить("СубконтоДт3",				"СубконтоДт3");
	Результат.Вставить("ВалютаДт",					"ВалютаДт");
	Результат.Вставить("ПодразделениеДт",			"ПодразделениеДт");
	Результат.Вставить("НаправлениеДеятельностиДт",	"НаправлениеДеятельностиДт");
	
	Результат.Вставить("СчетКт", 					"СчетКт");
	Результат.Вставить("СубконтоКт1",				"СубконтоКт1");
	Результат.Вставить("СубконтоКт2",				"СубконтоКт2");
	Результат.Вставить("СубконтоКт3",				"СубконтоКт3");
	Результат.Вставить("ВалютаКт",					"ВалютаКт");
	Результат.Вставить("ПодразделениеКт",			"ПодразделениеКт");
	Результат.Вставить("НаправлениеДеятельностиКт",	"НаправлениеДеятельностиКт");
	
	Результат.Вставить("Регистратор",	"Регистратор");
	Результат.Вставить("Организация",	"Организация");
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ТекстЗапроса_ПередЗапросомТрансляцией

Функция ПолучитьШаблонТрансляции(ШаблонТрансляцииИлиШаблонВГО)
	
	ШаблонТрансляции = ШаблонТрансляцииИлиШаблонВГО;
	
	ТипВГО = Неопределено;
	Если Метаданные.Справочники.Найти("ШаблоныСверкиВГО") <> Неопределено Тогда
		ТипВГО = "СправочникСсылка.ШаблоныСверкиВГО";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипВГО) И (ТипЗнч(ШаблонТрансляции) = Тип(ТипВГО)) Тогда
		ШаблонТрансляции = ШаблонТрансляции
			.ТрансляцияПлановСчетовНаМСФОДляЭлиминации
			.ВыгрузитьКолонку("ШаблонТрансляцииСчетов");
	КонецЕсли;
	
	Возврат ШаблонТрансляции;

КонецФункции

Функция ТекстЗапроса_втПутиСубконто(НомераТаблиц)
	
	НомераТаблиц.Вставить("втПутиСубконто", НомераТаблиц.Количество());

	Возврат
	"ВЫБРАТЬ
	|	""СубконтоДт1"" КАК ИмяСубконто,
	|	1 КАК НомерСубконто,
	|	ИСТИНА КАК СторонаДт
	|ПОМЕСТИТЬ втПутиСубконто
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""СубконтоКт1"",
	|	1,
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""СубконтоДт2"",
	|	2,
	|	ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""СубконтоКт2"",
	|	2,
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""СубконтоДт3"",
	|	3,
	|	ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""СубконтоКт3"",
	|	3,
	|	ЛОЖЬ";

КонецФункции

Функция ТекстЗапроса_ДоступныеОтборы(НомераТаблиц)

	НомераТаблиц.Вставить("ДоступныеОтборы", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	т.ПолеБД КАК Поле,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА СТРНАЙТИ(т.ПолеБД, ""."") = 0
	|					ТОГДА т.ПолеБД
	|				ИНАЧЕ ЛЕВ(т.ПолеБД, СТРНАЙТИ(т.ПолеБД, ""."") - 1)
	|			КОНЕЦ КАК СТРОКА(300))) КАК Поле_Основание,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА СТРНАЙТИ(т.ПолеБД, ""."") = 0
	|					ТОГДА """"
	|				ИНАЧЕ ПОДСТРОКА(т.ПолеБД, СТРНАЙТИ(т.ПолеБД, ""."") + 1, ДЛИНАСТРОКИ(т.ПолеБД))
	|			КОНЕЦ КАК СТРОКА(300))) КАК Поле_Остаток,
	|	МАКСИМУМ(втПутиСубконто.СторонаДт) КАК ЭтоОтборПоДебету,
	|	ВЫБОР
	|		КОГДА втСпособыВычисления.СписокИерархия < 2
	|				И СТРНАЙТИ(т.ПолеБД, ""."") = 0
	|			ТОГДА NULL
	|		ИНАЧЕ ЕСТЬNULL(ВидыСубконтоСчет.ВидСубконтоСсылка, ВидыСубконтоКорСчет.ВидСубконтоСсылка)
	|	КОНЕЦ КАК ВидСубконтоСсылка,
	|	МАКСИМУМ(втСпособыВычисления.СписокИерархия) КАК СписокИерархия,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ВидыСубконтоСчет.ТипДанных, ВидыСубконтоКорСчет.ТипДанных) КАК СТРОКА(200))) КАК ТипДанных,
	|	МАКСИМУМ(ЕСТЬNULL(ВидыСубконтоСчет.НомерСтроки, ВидыСубконтоКорСчет.НомерСтроки)) КАК _ПримерНомерСубконто,
	|	МАКСИМУМ(ИД.Счет) КАК _ПримерСчет,
	|	МАКСИМУМ(т.ИмяПараметра) КАК _ПримерИмяПараметра,
	|	МАКСИМУМ(т.Ссылка) КАК _ПримерСсылка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ т.СпособВычисленияПараметра) КАК _СпособВычисленияПараметра
	|ИЗ
	|	Справочник.ИсточникиДанныхДляРасчетов.ТаблицаПараметровОтбораБД КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсточникиДанныхДляРасчетов КАК ИД
	|		ПО т.Ссылка = ИД.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПутиСубконто КАК втПутиСубконто
	|		ПО (т.ПолеБД ПОДОБНО втПутиСубконто.ИмяСубконто + ""%"")
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСпособыВычисления КАК втСпособыВычисления
	|		ПО т.СпособВычисленияПараметра = втСпособыВычисления.Способ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК ВидыСубконтоСчет
	|		ПО (ИД.Счет = ВидыСубконтоСчет.Ссылка)
	|			И (втПутиСубконто.НомерСубконто = ВидыСубконтоСчет.Номер)
	|			И (втПутиСубконто.СторонаДт = ИД.ТрансляцияДебет)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК ВидыСубконтоКорСчет
	|		ПО (ИД.КоррСчет = ВидыСубконтоКорСчет.Ссылка)
	|			И (втПутиСубконто.НомерСубконто = ВидыСубконтоКорСчет.Номер)
	|			И (втПутиСубконто.СторонаДт <> ИД.ТрансляцияДебет)
	|ГДЕ
	|	ИД.НазначениеРасчетов В
	|			(ВЫБРАТЬ
	|				т.Ссылка
	|			ИЗ
	|				Справочник.ПравилаОбработки КАК т
	|			ГДЕ
	|				т.Владелец В (&ШаблонТрансляции))
	|
	|СГРУППИРОВАТЬ ПО
	|	т.ПолеБД,
	|	ВЫБОР
	|		КОГДА втСпособыВычисления.СписокИерархия < 2
	|				И СТРНАЙТИ(т.ПолеБД, ""."") = 0
	|			ТОГДА NULL
	|		ИНАЧЕ ЕСТЬNULL(ВидыСубконтоСчет.ВидСубконтоСсылка, ВидыСубконтоКорСчет.ВидСубконтоСсылка)
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Поле";
	
КонецФункции

Функция ТекстЗапроса_ДоступныеПути(НомераТаблиц)
	
	НомераТаблиц.Вставить("ДоступныеПути", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	т.Поле КАК Поле,
	|	ВЫБОР
	|		КОГДА СТРНАЙТИ(т.Поле, ""."") = 0
	|			ТОГДА NULL
	|		ИНАЧЕ ЕСТЬNULL(ВидыСубконтоСчет.ВидСубконтоСсылка, ВидыСубконтоКорСчет.ВидСубконтоСсылка)
	|	КОНЕЦ КАК ВидСубконтоСсылка,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ВидыСубконтоСчет.ТипДанных, ВидыСубконтоКорСчет.ТипДанных) КАК СТРОКА(200))) КАК ТипДанных,
	|	МАКСИМУМ(т.Ссылка) КАК _Пример
	|ИЗ
	|	Справочник.ИсточникиДанныхДляРасчетов.ПравилаИспользованияПолейЗапроса КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсточникиДанныхДляРасчетов КАК ИД
	|		ПО т.Ссылка = ИД.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПутиСубконто КАК втПутиСубконто
	|		ПО (т.Поле ПОДОБНО втПутиСубконто.ИмяСубконто + ""%"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК ВидыСубконтоСчет
	|		ПО (ИД.Счет = ВидыСубконтоСчет.Ссылка)
	|			И (втПутиСубконто.НомерСубконто = ВидыСубконтоСчет.Номер)
	|			И (втПутиСубконто.СторонаДт = ИД.ТрансляцияДебет)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК ВидыСубконтоКорСчет
	|		ПО (ИД.КоррСчет = ВидыСубконтоКорСчет.Ссылка)
	|			И (втПутиСубконто.НомерСубконто = ВидыСубконтоКорСчет.Номер)
	|			И (втПутиСубконто.СторонаДт <> ИД.ТрансляцияДебет)
	|ГДЕ
	|	ИД.НазначениеРасчетов В
	|			(ВЫБРАТЬ
	|				т.Ссылка
	|			ИЗ
	|				Справочник.ПравилаОбработки КАК т
	|			ГДЕ
	|				т.Владелец В (&ШаблонТрансляции))
	|	И НЕ т.Поле В ("""", ""Сумма"")
	|	И т.Поле <> т.КодАналитики
	|	И т.КодАналитики <> ""АналитикаВалюта""
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА СТРНАЙТИ(т.Поле, ""."") = 0
	|			ТОГДА NULL
	|		ИНАЧЕ ЕСТЬNULL(ВидыСубконтоСчет.ВидСубконтоСсылка, ВидыСубконтоКорСчет.ВидСубконтоСсылка)
	|	КОНЕЦ,
	|	т.Поле"; 

КонецФункции

Функция ПроверитьСоставноеПолеТрансляции(СтрокаТаб, ПолноеИмяРегистра = "РегистрБухгалтерии.МСФО")
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрБухгалтерии.МСФО.Субконто КАК т
	|ГДЕ
	|	ЛОЖЬ
	|	И НЕ т.Значение ЕСТЬ NULL";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрБухгалтерии.МСФО", ПолноеИмяРегистра);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "т.Значение", "т.Значение." + СтрокаТаб.Поле_Остаток);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Попытка
		Результат = Запрос.Выполнить().Пустой();
	Исключение
		ОбработатьОшибкуТрансляции(СтрокаТаб);
	КонецПопытки;

КонецФункции

Функция ПроверитьПростоеПолеТрансляции(СтрокаТаб)
	
	ЭтоОшибка = Ложь;
		
	ОбъектМД = Метаданные.НайтиПоПолномуИмени(СтрокаТаб.ТипДанных);
	Если ОбъектМД <> Неопределено Тогда
		
		Ссылка =  ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(
			СтрокаТаб.ТипДанных).ПустаяСсылка();
		
	КонецЕсли;
	
	Если СтрНайти(СтрокаТаб.Поле_Остаток, ".") = 0 Тогда
		
		ЭтоОшибка = Не ОбщегоНазначенияКлиентСервер
			.ЕстьРеквизитИлиСвойствоОбъекта(Ссылка, СтрокаТаб.Поле_Остаток);
			
		Если ЭтоОшибка Тогда
			ОбработатьОшибкуТрансляции(СтрокаТаб);
		КонецЕсли;
			
	Иначе
		
		Попытка
			Проверка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				Ссылка, СтрокаТаб.Поле_Остаток);
		Исключение
			ОбработатьОшибкуТрансляции(СтрокаТаб);
		КонецПопытки;
		
	КонецЕсли;

КонецФункции

Процедура ОбработатьОшибкуТрансляции(СтрокаТаб)
	
	Таб = СтрокаТаб.Владелец();
	Таб.Удалить(СтрокаТаб);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
